In [1]:
import pandas as pd

In [26]:
um1 = pd.read_csv('../input/ase-units.csv.gz')
um1['Start.Date'] = um1['Effective.Date']
um2 = pd.read_csv('../input/all-sworn-units.csv.gz')

In [27]:
um1.head()

   ase-units_ID  Unit Effective.Date    End.Date  UID  Start.Date
0             1  14.0     2007-03-29  2007-03-28    1  2007-03-29
1             1  14.0     2007-03-29         NaN    1  2007-03-29
2             2  15.0     2007-03-29  2007-03-28    2  2007-03-29
3             2  15.0     2007-03-29         NaN    2  2007-03-29
4             3   1.0     1976-08-19  1976-08-20    3  1976-08-19

In [28]:
um2.head()

   all-sworn-units_ID  Unit  Start.Date    End.Date  UID
0               12735   3.0  2016-06-05         NaN    1
1               12735  14.0  2007-03-29  2007-03-28    1
2               12735  14.0  2007-03-29  2016-06-04    1
3               16413  15.0  2007-03-29  2007-03-28    2
4               16413  15.0  2007-03-29         NaN    2

In [29]:
uids = list(set(um1['UID']) & set(um2['UID']))
len(uids)

31587

In [30]:
um1 = um1[(um1['UID'].isin(uids)) & (um1['Effective.Date'].notnull())]
um2 = um2[(um2['UID'].isin(uids)) & (um2['Start.Date'].notnull()) & 
          (um2['Start.Date'] < max(um1['Effective.Date'].dropna()))]

In [31]:
um1.shape

(112487, 6)

In [32]:
um2.shape

(112488, 5)

In [43]:
um1 = um1.sort_values(['UID','Start.Date', 'End.Date'], na_position='last')
um2 = um2.sort_values(['UID','Start.Date', 'End.Date'], na_position='last')

In [ ]:
um1_n = []
num = 0
for i in um1['UID']:
    if

/Users/invinst/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  This is separate from the ipykernel package so we can avoid doing imports until

In [44]:
um1.head()

   ase-units_ID  Unit Effective.Date    End.Date  UID  Start.Date
0             1  14.0     2007-03-29  2007-03-28    1  2007-03-29
1             1  14.0     2007-03-29         NaN    1  2007-03-29
2             2  15.0     2007-03-29  2007-03-28    2  2007-03-29
3             2  15.0     2007-03-29         NaN    2  2007-03-29
6             3  22.0     1970-06-15  1971-01-15    3  1970-06-15

In [41]:
um2.head()

   all-sworn-units_ID  Unit  Start.Date    End.Date  UID
1               12735  14.0  2007-03-29  2007-03-28    1
2               12735  14.0  2007-03-29  2016-06-04    1
3               16413  15.0  2007-03-29  2007-03-28    2
4               16413  15.0  2007-03-29         NaN    2
5                4767   1.0  1976-08-19  1976-08-20    3

In [37]:
um12 = um1.merge(um2, how='inner', on = ['UID', 'Unit', 'Start.Date'])

In [39]:
um12.head()

,ase-units_ID,Unit,Effective.Date,End.Date_x,UID,Start.Date,all-sworn-units_ID,End.Date_y
0,1,14.0,2007-03-29,2007-03-28,1,2007-03-29,12735,2007-03-28
1,1,14.0,2007-03-29,2007-03-28,1,2007-03-29,12735,2016-06-04
2,1,14.0,2007-03-29,NaN,1,2007-03-29,12735,2007-03-28
3,1,14.0,2007-03-29,NaN,1,2007-03-29,12735,2016-06-04
4,2,15.0,2007-03-29,2007-03-28,2,2007-03-29,16413,2007-03-28